radarSettings = {
	["mapTexture"] = "images/map.jpg",
	["mapVignette"] = "images/vignette.png",
	["mapTextureSize"] = 3072,
	["mapWaterColor"] = {110, 158, 204},
	["alpha"] = 250,
	["showStats"] = true
}

local blips = {
    {1555.5009765625, -1675.5712890625, 16.1953125, 30, "Los Santos Police Department"},
    {2467.8913574219, -1514.8662109375, 23.996250152588, 30, "Los Santos Sheriff Department"},
    {1172.0771484375, -1323.3544921875, 15.403011322021 , 22, "Los Santos Medical Department"},
    {1310.0205078125, -1366.7958984375, 13.506195068359 , 52, "Bank of Santos"},
    {2292.25, -1722.6865234375, 13.546875, 27, "Yedek Anahtarcı"},
    {2105.48828125, -1806.4501953125, 13.5546875, 50, "Pizza Stack"},
    {2637.8994140625, -2116.646484375, 13.546875, 63, "Araç Parçalama"},
    {2130.015625, -2156.2685546875, 14.689163208008, 55, "Ekonomik Galeri"},
	{2128.302734375, -1130.6826171875, 25.550813674927, 55, "Orta Galeri"},
	{550.9482421875, -1285.0009765625, 21.089172363281, 55, "Lüks Galeri"},
    {1786.7568359375, -1865.0390625, 13.573119163513, 55, "Taksi Şoförlüğü"},
    {2336.08984375, -2079.8369140625, 13.553783416748, 51, "Beton Taşımacılığı"},
    {2281.6103515625, -2364.5673828125, 13.546875, 51, "Tır Şoförlüğü"},
    {1615.2705078125, -1841.58984375, 13.529098510742, 51, "Çöpcülük Mesleği"},
    {2218.4248046875, -2663.46484375, 13.549717903137, 51, "Kamyon Şoförlüğü"},
    {2449.8818359375, -2645.7021484375, 13.662845611572, 51,"Sigara Kaçakcılığı"},
    {2572.67578125, -2427.833984375, 13.633173942566 , 51, "Alkol Kaçakcılığı"},
    {1010.2001953125, -1867.55859375, 12.852012634277, 56, "Turist Mesleği"},
    {366, -2030, 12.852012634277, 9, "Balıkçılık"},
    {649.2919921875, -1359.3642578125, 12.852012634277, 9, "BBC TV"},
    {1423.248046875, -1292.0322265625, 12.852012634277, 18, "Mermici"},
    {1292.623046875, -2352.373046875, 13.153707504272, 49, "Hediye Ağacı"},
    {1953.57421875, 206.6494140625, 30.77165222168, 15, "Kenevir Toplama Bölgesi"},
    {2201.27734375, -1970.216796875, 13.78413105011, 15, "Kenevir İşleme Bölgesi"}
}

local blipElements = {}

addEventHandler("onClientResourceStart", resourceRoot, function()
	for _, blip in ipairs(blips) do 
        blipElements[blip] = createBlip(blip[1], blip[2], blip[3], blip[4], 2, 255, 255, 255, 255, 0, 350)
        setElementData(blipElements[blip], "name", blip[5])
    end
end)